[
  {
    "title": "Revamp Code Academy",
    "slug": "revamp-code-academy",
    "short": "Backend platform for an online academy featuring banking, fintech, user management, and transaction modules.",
    "description": "Revamp Code Academy is a backend application built using Go and the Gin web framework. It handles banking operations, fintech flows, user account management, top-up processes, financial transactions, and system-level operations. Designed to improve stability, security, and performance of the Code Academy platform.",
    "stack": ["Go", "Gin", "PostgreSQL", "Sqlc", "REST API"],
    "cover": "/assets/projects/revamp-academy-cover.jpg",
    "screenshots": [],
    "repo": "",
    "live": "",
    "category": "Backend",
    "year": 2023
  },
  {
    "title": "Ristorante Con Fusion",
    "slug": "ristorante-con-fusion",
    "short": "Full-stack web and mobile application for a fictional restaurant.",
    "description": "Ristorante Con Fusion is a full-stack project consisting of web and mobile applications for a fictional restaurant. The backend is built with Node.js and Express, MongoDB as the database, and the front-end with React, Angular, HTML, CSS, and Bootstrap 4. The project focuses on clean UI, modern frameworks, and API integration.",
    "stack": ["Node.js", "Express", "MongoDB", "React", "Angular", "Bootstrap4", "JavaScript"],
    "cover": "/assets/projects/ristorante-cover.jpg",
    "screenshots": [],
    "repo": "",
    "live": "",
    "category": "Web",
    "year": 2023
  },
  {
    "title": "Architecting with Google Compute Engine",
    "slug": "gcp-architecting",
    "short": "Hands-on cloud architecture exercises using Google Cloud Platform.",
    "description": "A cloud computing project completed through Qwiklabs, focusing on the use of Google Compute Engine and other GCP services. Includes real-world deployment simulations and cloud solution architecture exercises to build strong hands-on cloud engineering capabilities.",
    "stack": ["Google Cloud", "Compute Engine", "Cloud Architecture"],
    "cover": "/assets/projects/gcp-architect-cover.jpg",
    "screenshots": [],
    "repo": "",
    "live": "",
    "category": "Cloud",
    "year": 2023
  },
  {
    "title": "Stoichify — Mobile Learning App",
    "slug": "stoichify-mobile-learning",
    "short": "Interactive mobile learning app with videos, quizzes, games, and chemistry simulations.",
    "description": "Stoichify is an Android-based learning application designed to provide interactive chemistry education through video content, quizzes, games, and simulations. Built with a modern mobile architecture to support engaging and accessible digital learning.",
    "stack": ["Android", "Kotlin", "Firebase", "Retrofit", "Glide", "Room"],
    "cover": "/assets/projects/stoichify-cover.jpg",
    "screenshots": [],
    "repo": "",
    "live": "",
    "category": "Mobile",
    "year": 2022
  },
  {
    "title": "Indocyber Mobile Apps Collection",
    "slug": "indocyber-mobile-apps",
    "short": "A collection of high-performance mobile applications developed to improve user experience and engagement.",
    "description": "A portfolio of 10+ Android applications developed at PT Indocyber Global Teknologi. Work includes optimizing mobile performance, reducing load time by up to 50%, and enhancing user engagement by 40%. Contributions span end-to-end development, debugging, and system optimization.",
    "stack": ["Android", "Java", "Kotlin", "API Integration"],
    "cover": "/assets/projects/indocyber-apps-cover.jpg",
    "screenshots": [],
    "repo": "",
    "live": "",
    "category": "Mobile",
    "year": 2021
  },
  {
    "title": "The Battle of Neighborhoods — Data Science Project",
    "slug": "battle-of-neighborhoods",
    "short": "Data analysis project comparing neighborhoods using clustering and geospatial visualization.",
    "description": "A data science project designed to help migrants identify the best neighborhoods in Scarborough by analyzing multiple neighborhood features. Techniques include k-means clustering, geospatial visualization using Folium, Pandas data manipulation, and location retrieval using Geocoder.",
    "stack": ["Python", "Pandas", "Folium", "Scikit-Learn", "Matplotlib", "JSON", "XML", "Geocoder"],
    "cover": "/assets/projects/battle-hoods-cover.jpg",
    "screenshots": [],
    "repo": "",
    "live": "",
    "category": "Data Science",
    "year": 2020
  },
  {
    "title": "Security Infrastructure Design for Online Retailer",
    "slug": "security-infrastructure-design",
    "short": "Security architecture design for a fictional online retail company.",
    "description": "A security infrastructure design project aiming to protect customer data for a fictional online retailer. Includes designing website security, intranet protection, VPN access, firewall rules, wireless security, and secure laptops. Demonstrates practical implementation of multi-layered security measures.",
    "stack": ["Security Architecture", "Network Security", "Infrastructure Design"],
    "cover": "/assets/projects/security-design-cover.jpg",
    "screenshots": [],
    "repo": "",
    "live": "",
    "category": "Cybersecurity",
    "year": 2020
  },
  {
    "title": "Tracer Study",
    "slug": "tracer-study-system",
    "short": "Alumni tracking system with online survey and interactive career dashboards.",
    "description": "Tracer Study is a digital platform used to track, collect, and analyze alumni career data. It includes an online questionnaire system and an interactive dashboard for visualizing alumni career progress. Designed for UIN Syarif Hidayatullah Jakarta as part of their institutional career mapping initiative.",
    "stack": ["Data Analysis", "Survey System", "Dashboard"],
    "cover": "/assets/projects/tracer-study-cover.jpg",
    "screenshots": [],
    "repo": "",
    "live": "",
    "category": "Data Platform",
    "year": 2018
  }
]
